OpenFOAM/foam9tutorials/CFD/firePlume_McCaffrey_57.5kW/constant/LESProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      LESProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

LESModel        dynamicSmagorinskyVariablePrt;

delta           cubeRootVol;

turbulence      on;

printCoeffs     on;

dynamicSmagorinskyVariablePrtCoeffs
{
    filter      simple;
    ce          1.0;
}

cubeRootVolCoeffs
{
    deltaCoeff      1;
}

// ************************************************************************* //
