OpenFOAM/foam9tutorials/CFD/firePlume_McCaffrey_57.5kW/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    burner
    {
        type            flowRateInletVelocity;
        massFlowRate    constant 0.0011492827;  //kg/s - 57.5 kW  (DHc_CH4 = 50.031207 MJ/kg)
        value           uniform (0 0 0);
    }

    burnerWalls
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }

    open
    {
        type            pressureInletOutletVelocity;
        phi             phi;
        value           uniform ( 0 0 0 );
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform ( 0 0 0 );
        value           uniform ( 0 0 0 );
    }
}
