OpenFOAM/foam9tutorials/CFD/firePlume_McCaffrey_57.5kW/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    burnerFace;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-0.15 -0.0001 -0.15)(0.15 0.0001 0.15);
        }
    }

    {
        name    burnerFace;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet burnerFace;
        }
    }

);


// ************************************************************************* //
